shelltube/0/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (1 0 0);

boundaryField
{
    walls
    {
        type            noSlip;
    }

    inlet
    {
    	type			fixedValue;
    	value			$internalField;
    }
    
    outlet
    {
    	type			inletOutlet;
    	inletValue		uniform (1 0 0);
    	value			uniform (1 0 0);
    }
}

// ************************************************************************* //
