shelltube/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices
(
    (0.05 -0.02 -0.02)
    (0.05 -0.02 0.19)
    (0.05  0.02 0.19)
    (0.05  0.02 -0.02)
    (1.02 -0.02 -0.02)
    (1.02 -0.02 0.19)
    (1.02  0.02 0.19)
    (1.02  0.02 -0.02)
    
);

blocks
(
    hex (0 3 2 1 4 7 6 5) (50 20 20) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    walls
    {
        type patch;
        faces
        (
            (0 1 5 4)
            (1 5 6 2)
            (2 6 7 3)
            (0 4 7 3)
        );
    }
    inlet
    {
        type patch;
        faces
        (
            (0 3 2 1)
        );
    }
    outlet
    {
        type patch;
        faces
        (
            (4 7 6 5)
        );
    }
);

// ************************************************************************* //
